_posts_bak/2020-10-14-Space-Vim-Install.html
---
layout: post
title: Space Vim 설치
tags: SpaceVim
---

<div id="outline-container-orgfec548f" class="outline-2">
<h2 id="orgfec548f">SpaceVim 설치</h2>
<div class="outline-text-2" id="text-orgfec548f">
</div>
<div id="outline-container-orgffeeac7" class="outline-3">
<h3 id="orgffeeac7">SpaceVim 설치 명령어</h3>
<div class="outline-text-3" id="text-orgffeeac7">
<pre class="example">
curl -sLf https://spacevim.org/install.sh | bash
</pre>

<p>
vim하면 실행된다.
</p>

<p>
vim, nvim 모두 설치된 환경에서 nvim에만 설치하기
</p>
<pre class="example">
curl -sLf https://spacevim.org/install.sh | bash -s -- --install neovim
</pre>
</div>
</div>

<div id="outline-container-org46c0d1c" class="outline-3">
<h3 id="org46c0d1c">SpaceVim 지우기</h3>
<div class="outline-text-3" id="text-org46c0d1c">
<p>
원래 있던 vim으로 연결해준다.
</p>
<pre class="example">
curl -sLf https://spacevim.org/install.sh | bash -s -- --uninstall
</pre>
</div>
</div>

<div id="outline-container-org344b04e" class="outline-3">
<h3 id="org344b04e">환경설정 파일 위치</h3>
<div class="outline-text-3" id="text-org344b04e">
<pre class="example">
~/.SpaceVim.d/init.toml
</pre>
</div>

<div id="outline-container-orgbd7993f" class="outline-4">
<h4 id="orgbd7993f">내 config example</h4>
<div class="outline-text-4" id="text-orgbd7993f">
<pre class="example">
# All SpaceVim option below [option] section
[options]
    # set spacevim theme. by default colorscheme layer is not loaded,
    # if you want to use more colorscheme, please load the colorscheme
    # layer
   colorscheme = "codedark"
    #colorscheme = "gruvbox"
    # colorscheme = "onedark"
    colorscheme_bg = "dark"
    # Disable guicolors in basic mode, many terminal do not support 24bit
    # true colors
    enable_guicolors = true
    # Disable statusline separator, if you want to use other value, please
    # install nerd fonts
    statusline_separator = "arrow"
    statusline_inactive_separator = "arrow"
    buffer_index_type = 4
    enable_tabline_filetype_icon = true
    enable_statusline_mode = false

[[custom_plugins]]
  name="tomasiser/vim-code-dark"
  merged = 0
# Enable autocomplete layer
[[layers]]
  name = 'autocomplete'
  auto_completion_return_key_behavior = "complete"
  auto_completion_tab_key_behavior = "smart"

[[layers]]
  name = 'shell'
  default_position = 'top'
  default_height = 30

[[layers]]
  name = 'fzf'
#name = 'denite'

[[layers]]
  name = 'gtags'

[[layers]]
  name = 'tmux'

[[layers]]
  name = "lang#c"
  enable_clang_syntax_highlight = true
</pre>
</div>
</div>
</div>

<div id="outline-container-org2c28efa" class="outline-3">
<h3 id="org2c28efa">Referene</h3>
<div class="outline-text-3" id="text-org2c28efa">
<ul class="org-ul">
<li><a href="https://spacevim.org/quick-start-guide">https://spacevim.org/quick-start-guide</a></li>
<li><a href="https://velog.io/@ausg/monsters-use-vim">https://velog.io/@ausg/monsters-use-vim</a></li>
</ul>
</div>
</div>
</div>
